{
  "base_model_name_or_path": "gpt2",
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "r": 16,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "target_modules": [
    "c_attn",
    "c_proj"
  ],
  "bias": "none",
  "inference_mode": true
}